perf/results/elasticsearch/read_100rps.txt
Running 30s test @ http://localhost:9411
  2 threads and 20 connections
  Thread calibration: mean lat.: 0.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.83s     5.52s   26.74s    51.11%
    Req/Sec     1.24     19.24   400.00     99.54%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   21.61s 
 75.000%   21.81s 
 90.000%   21.82s 
 99.000%   26.76s 
 99.900%   26.76s 
 99.990%   26.76s 
 99.999%   26.76s 
100.000%   26.76s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10805.247     0.000000            2         1.00
   11001.855     0.100000            9         1.11
   11001.855     0.200000            9         1.25
   11010.047     0.300000           21         1.43
   11010.047     0.400000           21         1.67
   21610.495     0.500000           27         2.00
   21610.495     0.550000           27         2.22
   21610.495     0.600000           27         2.50
   21807.103     0.650000           38         2.86
   21807.103     0.700000           38         3.33
   21807.103     0.750000           38         4.00
   21807.103     0.775000           38         4.44
   21807.103     0.800000           38         5.00
   21807.103     0.825000           38         5.71
   21823.487     0.850000           44         6.67
   21823.487     0.875000           44         8.00
   21823.487     0.887500           44         8.89
   21823.487     0.900000           44        10.00
   21823.487     0.912500           44        11.43
   21823.487     0.925000           44        13.33
   21823.487     0.937500           44        16.00
   21823.487     0.943750           44        17.78
   21823.487     0.950000           44        20.00
   21823.487     0.956250           44        22.86
   21823.487     0.962500           44        26.67
   21823.487     0.968750           44        32.00
   21823.487     0.971875           44        35.56
   21823.487     0.975000           44        40.00
   26755.071     0.978125           45        45.71
   26755.071     1.000000           45          inf
#[Mean    =    16833.377, StdDeviation   =     5521.069]
#[Max     =    26738.688, Total count    =           45]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  45 requests in 30.06s, 7.12KB read
  Socket errors: connect 0, read 1, write 0, timeout 260
  Non-2xx or 3xx responses: 45
Requests/sec:      1.50
Transfer/sec:     242.53B